; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	Star3 - direction
	Star2 - direction
	Star0 - direction
	Star4 - direction
	Star1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star16)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star17)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star1)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star4)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph2)
	(supports instrument8 image1)
	(calibration_target instrument8 Star1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite0 Star11)
	(pointing satellite2 Star16)
	(have_image Star5 spectrograph0)
	(have_image Phenomenon6 spectrograph0)
	(have_image Planet7 image1)
	(have_image Star8 thermograph2)
	(have_image Star10 spectrograph0)
	(have_image Star11 thermograph2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 spectrograph0)
	(have_image Star15 thermograph2)
	(have_image Star16 spectrograph0)
	(have_image Star17 spectrograph0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 13
2. (turn_to satellite4 phenomenon13 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 13
3. (turn_to satellite4 star1 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 star1)
   goals met: 0 of 13
4. (calibrate satellite4 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 13
5. (turn_to satellite4 phenomenon13 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 13
6. (take_image satellite4 phenomenon13 instrument6 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 1 of 13
7. (turn_to satellite4 phenomenon6 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon6)
   goals met: 1 of 13
8. (take_image satellite4 phenomenon6 instrument6 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 2 of 13
9. (turn_to satellite4 planet14 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet14)
   goals met: 2 of 13
10. (take_image satellite4 planet14 instrument6 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 3 of 13
11. (turn_to satellite4 planet7 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet7)
   goals met: 3 of 13
12. (take_image satellite4 planet7 instrument6 image1)
   added: (have_image planet7 image1)
   goals met: 4 of 13
13. (turn_to satellite4 star10 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star10)
   goals met: 4 of 13
14. (take_image satellite4 star10 instrument6 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 13
15. (turn_to satellite4 star11 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star11)
   goals met: 5 of 13
16. (take_image satellite4 star11 instrument6 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 6 of 13
17. (turn_to satellite4 star15 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star15)
   goals met: 6 of 13
18. (take_image satellite4 star15 instrument6 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 7 of 13
19. (turn_to satellite4 star16 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star16)
   goals met: 7 of 13
20. (take_image satellite4 star16 instrument6 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 8 of 13
21. (turn_to satellite4 star17 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star17)
   goals met: 8 of 13
22. (take_image satellite4 star17 instrument6 spectrograph0)
   added: (have_image star17 spectrograph0)
   goals met: 9 of 13
23. (turn_to satellite4 star5 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star5)
   goals met: 9 of 13
24. (take_image satellite4 star5 instrument6 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 10 of 13
25. (turn_to satellite4 star8 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star8)
   goals met: 10 of 13
26. (take_image satellite4 star8 instrument6 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 11 of 13
27. (turn_to satellite2 star16 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star16)
   goals met: 12 of 13
28. (turn_to satellite0 star11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star11)
   goals met: 13 of 13
